Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/atdf/ATSAMV71N19.atdf
      <value-group caption="" name="UART_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic echo" name="AUTOMATIC" value="0x1"/>
        <value caption="Local loopback" name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote loopback" name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="" name="UART_CMPR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="" name="UART_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x554152"/>
      </value-group>
    </module>
    <module name="USART" caption="Universal Synchronous Asynchronous Receiver Transmitter" id="6089" version="ZU">
      <register-group name="USART">
        <register caption="Control Register" name="US_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Start Break" mask="0x00000200" name="STTBRK"/>
          <bitfield caption="Stop Break" mask="0x00000400" name="STPBRK"/>
          <bitfield caption="Clear TIMEOUT Flag and Start Timeout After Next Character Received" mask="0x00000800" name="STTTO"/>
          <bitfield caption="Send Address" mask="0x00001000" name="SENDA"/>
          <bitfield caption="Reset Iterations" mask="0x00002000" name="RSTIT"/>
          <bitfield caption="Reset Non Acknowledge" mask="0x00004000" name="RSTNACK"/>
          <bitfield caption="Start Timeout Immediately" mask="0x00008000" name="RETTO"/>
          <bitfield caption="Data Terminal Ready Enable" mask="0x00010000" name="DTREN"/>
          <bitfield caption="Data Terminal Ready Disable" mask="0x00020000" name="DTRDIS"/>
          <bitfield caption="Request to Send Pin Control" mask="0x00040000" name="RTSEN"/>
          <bitfield caption="Request to Send Pin Control" mask="0x00080000" name="RTSDIS"/>
          <bitfield caption="Abort LIN Transmission" mask="0x00100000" name="LINABT"/>
          <bitfield caption="Send LIN Wakeup Signal" mask="0x00200000" name="LINWKUP"/>
        </register>
        <register caption="Mode Register" name="US_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="US_MR__USART_MODE"/>
          <bitfield caption="Clock Selection" mask="0x00000030" name="USCLKS" values="US_MR__USCLKS"/>
          <bitfield caption="Character Length" mask="0x000000C0" name="CHRL" values="US_MR__CHRL"/>
          <bitfield caption="Synchronous Mode Select" mask="0x00000100" name="SYNC"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="US_MR__PAR"/>
          <bitfield caption="Number of Stop Bits" mask="0x00003000" name="NBSTOP" values="US_MR__NBSTOP"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="US_MR__CHMODE"/>
          <bitfield caption="Bit Order" mask="0x00010000" name="MSBF"/>
          <bitfield caption="9-bit Character Length" mask="0x00020000" name="MODE9"/>
          <bitfield caption="Clock Output Select" mask="0x00040000" name="CLKO"/>
          <bitfield caption="Oversampling Mode" mask="0x00080000" name="OVER"/>
          <bitfield caption="Inhibit Non Acknowledge" mask="0x00100000" name="INACK"/>
          <bitfield caption="Disable Successive NACK" mask="0x00200000" name="DSNACK"/>
          <bitfield caption="Variable Synchronization of Command/Data Sync Start Frame Delimiter" mask="0x00400000" name="VAR_SYNC"/>
          <bitfield caption="Inverted Data" mask="0x00800000" name="INVDATA"/>
          <bitfield caption="Maximum Number of Automatic Iteration" mask="0x07000000" name="MAX_ITERATION"/>
          <bitfield caption="Receive Line Filter" mask="0x10000000" name="FILTER"/>
          <bitfield caption="Manchester Encoder/Decoder Enable" mask="0x20000000" name="MAN"/>
          <bitfield caption="Manchester Synchronization Mode" mask="0x40000000" name="MODSYNC"/>
          <bitfield caption="Start Frame Delimiter Selector" mask="0x80000000" name="ONEBIT"/>
        </register>
        <register caption="Interrupt Enable Register" name="US_IER" offset="0x0008" rw="W" size="4" atomic-op="set:US_IMR">
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Timeout Interrupt Enable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max number of Repetitions Reached Interrupt Enable" mask="0x00000400" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt Enable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Enable" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Enable" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Interrupt Enable" mask="0x00040000" name="DCDIC"/>
          <bitfield caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Enable" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="Interrupt Disable Register" name="US_IDR" offset="0x000C" rw="W" size="4" atomic-op="clear:US_IMR">
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Disable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Timeout Interrupt Disable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Disable" mask="0x00000400" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt Disable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Disable" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Disable" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Interrupt Disable" mask="0x00040000" name="DCDIC"/>
          <bitfield caption="Clear to Send Input Change Interrupt Disable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Disable" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="Interrupt Mask Register" name="US_IMR" offset="0x0010" rw="R" size="4" atomic-op="read:US_IMR">
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Mask" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" name="PARE"/>
          <bitfield caption="Timeout Interrupt Mask" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Mask" mask="0x00000400" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt Mask" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Mask" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Mask" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Interrupt Mask" mask="0x00040000" name="DCDIC"/>
          <bitfield caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Mask" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="Channel Status Register" name="US_CSR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready (cleared by reading US_RHR)" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing US_THR)" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000080" name="PARE"/>
          <bitfield caption="Receiver Timeout (cleared by writing a one to bit US_CR.STTTO)" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (cleared by writing US_THR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT)" mask="0x00000400" name="ITER"/>
          <bitfield caption="Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK)" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Flag (cleared on read)" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Flag (cleared on read)" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Flag (cleared on read)" mask="0x00040000" name="DCDIC"/>
          <bitfield caption="Clear to Send Input Change Flag (cleared on read)" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Image of RI Input" mask="0x00100000" name="RI"/>
          <bitfield caption="Image of DSR Input" mask="0x00200000" name="DSR"/>
          <bitfield caption="Image of DCD Input" mask="0x00400000" name="DCD"/>
          <bitfield caption="Image of CTS Input" mask="0x00800000" name="CTS"/>
          <bitfield caption="Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA)" mask="0x01000000" name="MANERR"/>
        </register>
        <register caption="Receive Holding Register" name="US_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000001FF" name="RXCHR"/>
          <bitfield caption="Received Sync" mask="0x00008000" name="RXSYNH"/>
        </register>
        <register caption="Transmit Holding Register" name="US_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" name="TXCHR"/>
          <bitfield caption="Sync Field to be Transmitted" mask="0x00008000" name="TXSYNH"/>
        </register>
        <register caption="Baud Rate Generator Register" name="US_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x0000FFFF" name="CD"/>
          <bitfield caption="Fractional Part" mask="0x00070000" name="FP"/>
        </register>
