Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71/atdf/ATSAMV71N19.atdf
    <module name="SCnSCB" caption="System control not in SCB">
            <register-group name="SCnSCB" caption="System control Register not in SCB">
                <register offset="0x00000004" size="4" name="ICTR" initval="0" rw="R" caption="Interrupt Controller Type Register">
                    <bitfield mask="0x0000000f" name="INTLINESNUM" caption="Total number of interrupt lines supported by an implementation, defined in groups of 32"/>
                </register>
                <register offset="0x00000008" size="4" name="ACTLR" initval="0" caption="Auxiliary Control Register">
                    <bitfield mask="0x00000004" name="DISFOLD" caption="Disables folding of IT instructions"/>
                    <bitfield mask="0x00000400" name="FPEXCODIS" caption="Disables FPU exception outputs"/>
                    <bitfield mask="0x00000800" name="DISRAMODE" caption="Disables dynamic read allocate mode for Write-Back Write-Allocate memory regions"/>
                    <bitfield mask="0x00001000" name="DISITMATBFLUSH" caption="Disables ITM and DWT ATB flush"/>
                    <bitfield mask="0x00002000" name="DISBTACREAD"/>
                    <bitfield mask="0x00004000" name="DISBTACALLOC"/>
                    <bitfield mask="0x00008000" name="DISCRITAXIRUR"/>
                    <bitfield mask="0x001f0000" name="DISDI"/>
                    <bitfield mask="0x03e00000" name="DISISSCH1"/>
                    <bitfield mask="0x04000000" name="DISDYNADD" caption="Disables dynamic allocation of ADD and SUB instructions"/>
                    <bitfield mask="0x08000000" name="DISCRITAXIRUW" caption="Disable critical AXI read-under-write"/>
                    <bitfield mask="0x10000000" name="DISFPUISSOPT" caption="Disables dynamic allocation of ADD and SUB instructions"/>
                </register>
              </register-group>
        </module><module name="SCB" oldname="SystemControl" caption="System Control Block">
            <register-group name="SCB" caption="System Control Block Registers">
                <register offset="0x00000000" size="4" name="CPUID" initval="0x411FC271" rw="R" caption="CPUID Base Register">
                    <bitfield mask="0x0000000f" name="REVISION" caption="Indicates patch release: 0x0 = Patch 0"/>
                    <bitfield mask="0x0000fff0" name="PARTNO" caption="Indicates part number"/>
                    <bitfield mask="0x000f0000" name="ARCHITECTURE" caption="Indicates architecture. Reads as 0xF"/>
                    <bitfield mask="0x00f00000" name="VARIANT" caption="Indicates processor revision: 0x2 = Revision 2"/>
                    <bitfield mask="0xff000000" name="IMPLEMENTER" caption="Implementer code"/>
                </register>
                <register offset="0x00000004" size="4" name="ICSR" initval="0" caption="Interrupt Control and State Register">
                    <bitfield mask="0x000001ff" name="VECTACTIVE" caption="Active exception number"/>
                    <bitfield mask="0x00000800" name="RETTOBASE" values="RETTOBASE" caption="Indicates whether there is an active exception other than the exception indicated by the current value of the IPSR"/>
                    <bitfield mask="0x0003f000" name="VECTPENDING" caption="Exception number of the highest priority pending enabled exception"/>
                    <bitfield mask="0x00400000" name="ISRPENDING" caption="Is external interrupt, generated by the NVIC, pending"/>
                    <bitfield mask="0x00800000" name="ISRPREEMPT" values="ISRPREEMPT" caption="Indicates whether a pending exception will be serviced on exit from debug halt state"/>
                    <bitfield mask="0x02000000" name="PENDSTCLR" values="PENDSTCLR" caption="Removes the pending status of the SysTick exception"/>
                    <bitfield mask="0x04000000" name="PENDSTSET" values="PENDSTSET" caption="Sets the SysTick exception as pending, or reads the current state of the exception"/>
                    <bitfield mask="0x08000000" name="PENDSVCLR" values="PENDSVCLR" caption="Removes the pending status of the PendSV exception"/>
                    <bitfield mask="0x10000000" name="PENDSVSET" values="PENDSVSET" caption="Sets the PendSV exception as pending, or reads the current state of the exception"/>
                    <bitfield mask="0x80000000" name="NMIPENDSET" values="NMIPENDSET" caption="Makes the NMI exception active, or reads the state of the exception"/>
                </register>
                <register offset="0x00000008" size="4" name="VTOR" initval="0" caption="Vector Table Offset Register">
                    <bitfield mask="0xffffff80" name="TBLOFF" caption="Bits[31:7] of the vector table address"/>
                </register>
                <register offset="0x0000000c" size="4" name="AIRCR" initval="0" caption="Application Interrupt and Reset Control Register">
                    <bitfield mask="0x00000001" name="VECTRESET" caption="Writing 1 to this bit causes a local system reset"/>
                    <bitfield mask="0x00000002" name="VECTCLRACTIVE" caption="Clears all active state information for fixed and configurable exceptions"/>
                    <bitfield mask="0x00000004" name="SYSRESETREQ" values="SYSRESETREQ" caption="System Reset Request"/>
                    <bitfield mask="0x00000700" name="PRIGROUP" caption="Interrupt priority grouping field. This field determines the split of group priority from subpriority."/>
                    <bitfield mask="0x00008000" name="ENDIANNESS" values="ENDIANNESS" caption="Memory system endianness"/>
                    <bitfield mask="0xffff0000" name="VECTKEY" caption="Vector key"/>
                </register>
                <register offset="0x00000010" size="4" name="SCR" initval="0" caption="System Control Register">
                    <bitfield mask="0x00000002" name="SLEEPONEXIT" values="SLEEPONEXIT" caption="Determines whether, on an exit from an ISR that returns to the base level of execution priority, the processor enters a sleep state"/>
                    <bitfield mask="0x00000004" name="SLEEPDEEP" values="SLEEPDEEP" caption="Provides a qualifying hint indicating that waking from sleep might take longer"/>
                    <bitfield mask="0x00000010" name="SEVONPEND" values="SEVONPEND" caption="Determines whether an interrupt transition from inactive state to pending state is a wakeup event"/>
                </register>
                <register offset="0x00000014" size="4" name="CCR" initval="0" caption="Configuration and Control Register">
                    <bitfield mask="0x00000001" name="NONBASETHRDENA" values="NONBASETHRDENA" caption="Controls whether the processor can enter Thread mode with exceptions active"/>
                    <bitfield mask="0x00000002" name="USERSETMPEND" values="USERSETMPEND" caption="Enables unprivileged software access to the STIR"/>
                    <bitfield mask="0x00000008" name="UNALIGN_TRP" values="UNALIGN_TRP" caption="Enables unaligned access traps"/>
                    <bitfield mask="0x00000010" name="DIV_0_TRP" values="DIV_0_TRP" caption="Enables faulting or halting when the processor executes an SDIV or UDIV instruction with a divisor of 0"/>
                    <bitfield mask="0x00000100" name="BFHFNMIGN" values="BFHFNMIGN" caption="Enables handlers with priority -1 or -2 to ignore data BusFaults caused by load and store instructions."/>
                    <bitfield mask="0x00000200" name="STKALIGN" values="STKALIGN" caption="Indicates stack alignment on exception entry"/>
                    <bitfield mask="0x00010000" name="DC" caption="Cache enable bit"/>
                    <bitfield mask="0x00020000" name="IC" caption="Instruction cache enable bi"/>
                    <bitfield mask="0x00040000" name="BP" caption="Branch prediction enable bi"/>
                </register>
                <register offset="0x00000018" size="4" name="SHPR1" initval="0" caption="System Handler Priority Register 1">
                    <bitfield mask="0x000000ff" name="PRI_4" caption="Priority of system handler 4, MemManage"/>
                    <bitfield mask="0x0000ff00" name="PRI_5" caption="Priority of system handler 5, BusFault"/>
                    <bitfield mask="0x00ff0000" name="PRI_6" caption="Priority of system handler 6, UsageFault"/>
                </register>
                <register offset="0x0000001c" size="4" name="SHPR2" initval="0" caption="System Handler Priority Register 2">
                    <bitfield mask="0xff000000" name="PRI_11" caption="Priority of system handler 11, SVCall"/>
                </register>
